# pandas
- 데이터 분석을 위한 오픈소스 python 라이브러리
- R과 Pandas의 특징
    - R보다 Pandas가 학습이 쉽다
    - Pandas가 성능이 좋다
    - Python은 활용 분야가 많다
- 크게 두가지 데이터 타입을 사용
    - Series : Index와 value로 이루어진 데이터 타입
    - DataFrame : index, column, value로 이루어진 데이터 타입

# Series
- 동일한 데이터 타입의 값을 갖는다

## 1. 선언
- 인덱스는 자동 설정

In [1]:
data = pd.Series(np.random.randint(10, size=5))
data

0    4
1    4
2    4
3    2
4    5
dtype: int64

## 2. index 설정

In [26]:
data = pd.Series(np.random.randint(10, size=5), index=list("ABCDE"))
data

A    4
B    7
C    2
D    1
E    9
dtype: int64

In [27]:
data.index, data.values

(Index(['A', 'B', 'C', 'D', 'E'], dtype='object'), array([4, 7, 2, 1, 9]))

In [28]:
data["B"], data.D

(7, 1)

In [29]:
data["C"] = 10
data

A     4
B     7
C    10
D     1
E     9
dtype: int64

## 3. 브로드 캐스팅

In [31]:
data * 10

A     40
B     70
C    100
D     10
E     90
dtype: int64

In [32]:
data[["B", "E"]]

B    7
E    9
dtype: int64

## 4. offset index

In [33]:
data[2::2]

C    10
E     9
dtype: int64

## 5. 연산

In [34]:
data1 = data
data1

A     4
B     7
C    10
D     1
E     9
dtype: int64

In [35]:
data2 = pd.Series({"D": 3, "E": 5, "F": 7})
data2

D    3
E    5
F    7
dtype: int64

In [36]:
# 같은 index끼리 더해짐
# 겹치는 것만 계산됨
result = data + data2
result

A     NaN
B     NaN
C     NaN
D     4.0
E    14.0
F     NaN
dtype: float64

## 6. null값 채우기

In [37]:
result.isnull()

A     True
B     True
C     True
D    False
E    False
F     True
dtype: bool

In [38]:
result[result.isnull()]

A   NaN
B   NaN
C   NaN
F   NaN
dtype: float64

In [39]:
## data가 NaN인 것 중, data1 에 있는 값만 들어감
result[result.isnull()] = data1
result

A     4.0
B     7.0
C    10.0
D     4.0
E    14.0
F     NaN
dtype: float64

In [40]:
## data가 NaN인 것에 값 20000을 넣기
result[result.isnull()] = 20000
result

A        4.0
B        7.0
C       10.0
D        4.0
E       14.0
F    20000.0
dtype: float64

# DataFrame
- 여러개의 Series로 구성
- 같은 컬럼에 있는 value값은 같은 데이터 타입을 갖습니다

## 1. 생성
### 1. 딕셔너리의 리스트
\
딕셔너리의 하나의 키가 하나의 컬럼으로 사용

In [80]:
datas = {
    "name": ["dss", "fcampe"],
    "email": ["dss@gmail.com", "cmap@gmail.com"]
}
datas

{'name': ['dss', 'fcampe'], 'email': ['dss@gmail.com', 'cmap@gmail.com']}

In [81]:
df = pd.DataFrame(datas)
df

     name           email
0     dss   dss@gmail.com
1  fcampe  cmap@gmail.com

In [82]:
data_count = len(datas["name"])
data_count

2

### 2. 리스트의 딕셔너리\
하나의 키값이 하나의 로우로\

In [51]:
datas = [
    {"name": "dss", "email": "dss@gmail.com"},
    {"name": "acmape", "email": "ampae@gmail.com"},
]
datas

[{'name': 'dss', 'email': 'dss@gmail.com'},
 {'name': 'acmape', 'email': 'ampae@gmail.com'}]

In [52]:
df = pd.DataFrame(datas)
df

     name            email
0     dss    dss@gmail.com
1  acmape  ampae@gmail.com

## 2. 인덱스 추가

In [53]:
df = pd.DataFrame(datas, index=["one", "two"])
df

       name            email
one     dss    dss@gmail.com
two  acmape  ampae@gmail.com

In [54]:
df.index

Index(['one', 'two'], dtype='object')

In [56]:
df.columns

Index(['name', 'email'], dtype='object')

In [57]:
df.values

array([['dss', 'dss@gmail.com'],
       ['acmape', 'ampae@gmail.com']], dtype=object)

## 3. 데이터 선택
- row
- column
- (row,column)

In [58]:
datas = [
    {"name": "dss", "email": "dss@gmail.com"},
    {"name": "acmape", "email": "ampae@gmail.com"},
]
datas

[{'name': 'dss', 'email': 'dss@gmail.com'},
 {'name': 'acmape', 'email': 'ampae@gmail.com'}]

### row 선택

In [83]:
df = pd.DataFrame(datas)
df

     name           email
0     dss   dss@gmail.com
1  fcampe  cmap@gmail.com

In [62]:
# 1번째 row : location
df.loc[1]["email"]

'ampae@gmail.com'

In [5]:
# 없으면 추가, 있으면 수정
df.loc[2] = {"name": "irela", "email": "uenalk@naver.com"}
df

     name             email
0     dss     dss@gmail.com
1  fcampe    cmap@gmail.com
3   jiesa     ena@naver.com
2   irela  uenalk@naver.com

### column 선택

In [64]:
df["name"]

0       dss
1    acmape
3     jiesa
Name: name, dtype: object

In [65]:
# 컬럼 생성
df["id"] = ""
df

     name            email id
0     dss    dss@gmail.com
1  acmape  ampae@gmail.com
3   jiesa    ena@naver.com

In [68]:
# 개수가 맞아야 들어감
# 전부 바꾸는 경우 데이터 타입이 바뀜
df["id"] = range(1, 4)
df

     name            email  id
0     dss    dss@gmail.com   1
1  acmape  ampae@gmail.com   2
3   jiesa    ena@naver.com   3

In [69]:
df.dtypes

name     object
email    object
id        int64
dtype: object

### row, column  선택
- location 먼저, 그리고 원하는 column

In [73]:
df.loc[[0, 1], ["email", "id"]]

             email  id
0    dss@gmail.com   1
1  ampae@gmail.com   2

## 4. 컬럼 데이터 순서 설정

In [75]:
df[["id", "name", "email"]]

   id    name            email
0   1     dss    dss@gmail.com
1   2  acmape  ampae@gmail.com
3   3   jiesa    ena@naver.com

## 5. head, tail

In [80]:
df.head(2)

     name            email  id
0     dss    dss@gmail.com   1
1  acmape  ampae@gmail.com   2

In [81]:
df.tail(2)

     name            email  id
1  acmape  ampae@gmail.com   2
3   jiesa    ena@naver.com   3

## 6. apply 함수
- map 과 비슷

In [84]:
# email 컬럼에서 메일의 도메인만 가져와서 새로운 domain 컬럼을 생성
df

     name           email
0     dss   dss@gmail.com
1  fcampe  cmap@gmail.com

In [85]:
def domain(email):
    return email.split("@")[1].split(".")[0]


domain(df.loc[0]["email"])

'gmail'

In [86]:
# data type : series
df["domain"] = df["email"].apply(domain)
df

     name           email domain
0     dss   dss@gmail.com  gmail
1  fcampe  cmap@gmail.com  gmail

In [87]:
# 한 줄로 작성 가능
df["domain"] = df["email"].apply(lambda email: email.split("@")[1].split(".")[0])
df

     name           email domain
0     dss   dss@gmail.com  gmail
1  fcampe  cmap@gmail.com  gmail

## 7. 여러가지 함수

In [88]:
from makedata import *

In [89]:
get_name(), get_age(), make_data()

('Adam',
 28,
 [{'Age': 25, 'Name': 'Jin'},
  {'Age': 31, 'Name': 'Billy'},
  {'Age': 31, 'Name': 'Jin'},
  {'Age': 26, 'Name': 'Anchal'},
  {'Age': 23, 'Name': 'Andrew'},
  {'Age': 22, 'Name': 'Billy'},
  {'Age': 22, 'Name': 'Alex'},
  {'Age': 23, 'Name': 'Billy'},
  {'Age': 20, 'Name': 'Arnold'},
  {'Age': 21, 'Name': 'Adam'}])

In [94]:
df1 = pd.DataFrame(make_data(5))
df1

   Age    Name
0   27    Alex
1   40   Alvin
2   20    Alan
3   23    Adam
4   34  Anchal

In [95]:
df2 = pd.DataFrame(make_data(5))
df2

   Age    Name
0   40  Arnold
1   33   Alvin
2   24     Jin
3   23     Jin
4   38  Arnold

### 1. append()
- 데이터 프레임 합치기

In [96]:
df3 = df1.append(df2)
df3

   Age    Name
0   27    Alex
1   40   Alvin
2   20    Alan
3   23    Adam
4   34  Anchal
0   40  Arnold
1   33   Alvin
2   24     Jin
3   23     Jin
4   38  Arnold

### 2. 인덱스 재정렬

In [97]:
df3.reset_index(drop=True, inplace=True)
df3.tail(5)

   Age    Name
5   40  Arnold
6   33   Alvin
7   24     Jin
8   23     Jin
9   38  Arnold

##### append 에서도 가능

In [98]:
df4 = df1.append(df2, ignore_index=True)
df4.tail(5)

   Age    Name
5   40  Arnold
6   33   Alvin
7   24     Jin
8   23     Jin
9   38  Arnold

### 3. concat
- row나 column으로 데이터 프레임을 합칠때 사용

In [99]:
df5 = pd.concat([df1, df2]).reset_index(drop=True)
df5

   Age    Name
0   27    Alex
1   40   Alvin
2   20    Alan
3   23    Adam
4   34  Anchal
5   40  Arnold
6   33   Alvin
7   24     Jin
8   23     Jin
9   38  Arnold

In [100]:
pd.concat([df4, df5], axis=1)

   Age    Name  Age    Name
0   27    Alex   27    Alex
1   40   Alvin   40   Alvin
2   20    Alan   20    Alan
3   23    Adam   23    Adam
4   34  Anchal   34  Anchal
5   40  Arnold   40  Arnold
6   33   Alvin   33   Alvin
7   24     Jin   24     Jin
8   23     Jin   23     Jin
9   38  Arnold   38  Arnold

In [2]:
help(pd.concat)

Help on function concat in module pandas.core.reshape.concat:

concat(objs: Union[Iterable[Union[ForwardRef('DataFrame'), ForwardRef('Series')]], Mapping[Union[Hashable, NoneType], Union[ForwardRef('DataFrame'), ForwardRef('Series')]]], axis=0, join='outer', ignore_index: bool = False, keys=None, levels=None, names=None, verify_integrity: bool = False, sort: bool = False, copy: bool = True) -> Union[ForwardRef('DataFrame'), ForwardRef('Series')]
    Concatenate pandas objects along a particular axis with optional set logic
    along the other axes.

    Can also add a layer of hierarchical indexing on the concatenation axis,
    which may be useful if the labels are the same (or overlapping) on
    the passed axis number.

    Parameters
    ----------
    objs : a sequence or mapping of Series or DataFrame objects
        If a dict is passed, the sorted keys will be used as the `keys`
        argument, unless it is passed, in which case the values will be
        selected (see below). Any None objects will be dropped silently unless
        they are all None in which case a ValueError will be raised.
    axis : {0/'index', 1/'columns'}, default 0
        The axis to concatenate along.
    join : {'inner', 'outer'}, default 'outer'
        How to handle indexes on other axis (or axes).
    ignore_index : bool, default False
        If True, do not use the index values along the concatenation axis. The
        resulting axis will be labeled 0, ..., n - 1. This is useful if you are
        concatenating objects where the concatenation axis does not have
        meaningful indexing information. Note the index values on the other
        axes are still respected in the join.
    keys : sequence, default None
        If multiple levels passed, should contain tuples. Construct
        hierarchical index using the passed keys as the outermost level.
    levels : list of sequences, default None
        Specific levels (unique values) to use for constructing a
        MultiIndex. Otherwise they will be inferred from the keys.
    names : list, default None
        Names for the levels in the resulting hierarchical index.
    verify_integrity : bool, default False
        Check whether the new concatenated axis contains duplicates. This can
        be very expensive relative to the actual data concatenation.
    sort : bool, default False
        Sort non-concatenation axis if it is not already aligned when `join`
        is 'outer'.
        This has no effect when ``join='inner'``, which already preserves
        the order of the non-concatenation axis.

        .. versionadded:: 0.23.0
        .. versionchanged:: 1.0.0

           Changed to not sort by default.

    copy : bool, default True
        If False, do not copy data unnecessarily.

    Returns
    -------
    object, type of objs
        When concatenating all ``Series`` along the index (axis=0), a
        ``Series`` is returned. When ``objs`` contains at least one
        ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
        the columns (axis=1), a ``DataFrame`` is returned.

    See Also
    --------
    Series.append : Concatenate Series.
    DataFrame.append : Concatenate DataFrames.
    DataFrame.join : Join DataFrames using indexes.
    DataFrame.merge : Merge DataFrames by indexes or columns.

    Notes
    -----
    The keys, levels, and names arguments are all optional.

    A walkthrough of how this method fits in with other tools for combining
    pandas objects can be found `here
    <https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>`__.

    Examples
    --------
    Combine two ``Series``.

    >>> s1 = pd.Series(['a', 'b'])
    >>> s2 = pd.Series(['c', 'd'])
    >>> pd.concat([s1, s2])
    0    a
    1    b
    0    c
    1    d
    dtype: object

    Clear the existing index and reset it in the result
    by setting the ``ignore_index`` option to ``True``.

    >>> pd.concat([s1, s2], ignore_index=True)
    0    a
    1    b
    2    c
    3    d
    dtype: object

    Add a hierarchical index at the outermost level of
    the data with the ``keys`` option.

    >>> pd.concat([s1, s2], keys=['s1', 's2'])
    s1  0    a
        1    b
    s2  0    c
        1    d
    dtype: object

    Label the index keys you create with the ``names`` option.

    >>> pd.concat([s1, s2], keys=['s1', 's2'],
    ...           names=['Series name', 'Row ID'])
    Series name  Row ID
    s1           0         a
                 1         b
    s2           0         c
                 1         d
    dtype: object

    Combine two ``DataFrame`` objects with identical columns.

    >>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
    ...                    columns=['letter', 'number'])
    >>> df1
      letter  number
    0      a       1
    1      b       2
    >>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
    ...                    columns=['letter', 'number'])
    >>> df2
      letter  number
    0      c       3
    1      d       4
    >>> pd.concat([df1, df2])
      letter  number
    0      a       1
    1      b       2
    0      c       3
    1      d       4

    Combine ``DataFrame`` objects with overlapping columns
    and return everything. Columns outside the intersection will
    be filled with ``NaN`` values.

    >>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
    ...                    columns=['letter', 'number', 'animal'])
    >>> df3
      letter  number animal
    0      c       3    cat
    1      d       4    dog
    >>> pd.concat([df1, df3], sort=False)
      letter  number animal
    0      a       1    NaN
    1      b       2    NaN
    0      c       3    cat
    1      d       4    dog

    Combine ``DataFrame`` objects with overlapping columns
    and return only those that are shared by passing ``inner`` to
    the ``join`` keyword argument.

    >>> pd.concat([df1, df3], join="inner")
      letter  number
    0      a       1
    1      b       2
    0      c       3
    1      d       4

    Combine ``DataFrame`` objects horizontally along the x axis by
    passing in ``axis=1``.

    >>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
    ...                    columns=['animal', 'name'])
    >>> pd.concat([df1, df4], axis=1)
      letter  number  animal    name
    0      a       1    bird   polly
    1      b       2  monkey  george

    Prevent the result from including duplicate index values with the
    ``verify_integrity`` option.

    >>> df5 = pd.DataFrame([1], index=['a'])
    >>> df5
       0
    a  1
    >>> df6 = pd.DataFrame([2], index=['a'])
    >>> df6
       0
    a  2
    >>> pd.concat([df5, df6], verify_integrity=True)
    Traceback (most recent call last):
        ...
    ValueError: Indexes have overlapping values: ['a']

In [38]:
pd.concat([df3, df1], axis=1, join="inner")

   Age     Name  Age     Name
0   35     Alex   35     Alex
1   37     Alex   37     Alex
2   36     Alex   36     Alex
3   34    Billy   34    Billy
4   38  Anthony   38  Anthony

### 4. groupby()
- 특정 컬럼의 중복되는 데이터를 합쳐서 새로운 데이터 프레임을 만드는 방법

In [101]:
df = pd.DataFrame(make_data())
df

   Age     Name
0   31  Anthony
1   31    Alvin
2   37     Alan
3   30   Anchal
4   37      Jin
5   20     Adam
6   33  Anthony
7   29     Alex
8   24    Billy
9   38    Billy

In [102]:
result_df = df.groupby("Name")
result_df

#### size()

In [103]:
result_df = df.groupby("Name").size()
result_df

Name
Adam       1
Alan       1
Alex       1
Alvin      1
Anchal     1
Anthony    2
Billy      2
Jin        1
dtype: int64

In [106]:
result_df = df.groupby("Name").size().reset_index(name="count")
result_df

      Name  count
0     Adam      1
1     Alan      1
2     Alex      1
3    Alvin      1
4   Anchal      1
5  Anthony      2
6    Billy      2
7      Jin      1

### 5. sort_values()
설정한 컬럼으로 데이터 프레임을 정렬

In [52]:
result_df.sort_values(["count", "Name"], ascending=False, inplace=True)
result_df.reset_index(drop=True, inplace=True)
result_df

      Name  count
0  Anthony      4
1    Billy      1
2   Arnold      1
3   Anchal      1
4     Alex      1
5     Alan      1
6     Adam      1

### 6. aggregation 함수

집계함수
- agg()
- size(), min(), max(), mean()

In [58]:
df.groupby("Name").agg("min").reset_index()

      Name  Age
0     Adam   39
1     Alan   28
2     Alex   32
3   Anchal   31
4  Anthony   21
5   Arnold   40
6    Billy   24

### 7. 데이터를 요약해서 보여주는 함수

In [59]:
df.describe()

            Age
count  10.00000
mean   28.30000
std     7.02456
min    21.00000
25%    23.25000
50%    26.00000
75%    31.75000
max    40.00000

### 8. merge = sql(join)
- 두개 이상의 데이터 프레임을 합쳐서 결과를 출력하는 방법

## quiz 1
- makedata 모듈을 이용해서 데이터 프레임 만들기
- user_df
    - 8명의 데이터
    - UserId : 1 ~ 8
    - Name : makedata.get_name()
    - Age : makedata.get_age()
    - 중복되는 Name 값이 없도록

In [46]:
import makedata

#### 딕셔너리의 리스트로 만들기

In [9]:
datas = {}
datas["UserID"] = range(1, 9)
name_ls = []
while len(name_ls) < 8:
    v = makedata.get_name()
    if v not in name_ls:
        name_ls.append(v)
datas["Name"] = name_ls
datas["Age"] = [makedata.get_age() for _ in range(8)]
user_df = pd.DataFrame(datas)
user_df

   UserID     Name  Age
0       1     Adam   31
1       2     Alan   36
2       3      Jin   32
3       4     Alex   31
4       5  Anthony   37
5       6   Arnold   28
6       7   Andrew   25
7       8    Alvin   31

#### 리스트의 딕셔너리로 만들기

In [8]:
data_ls = []
name_ls = []
while len(data_ls) < 8:
    name = makedata.get_name()
    if name not in name_ls:
        name_ls.append(name)
        row = {}
        row["UserID"] = len(data_ls) + 1
        row["Name"] = name
        row["Age"] = makedata.get_age()
        data_ls.append(row)
data_ls
df2 = pd.DataFrame(data_ls)
df2

   UserID     Name  Age
0       1   Anchal   31
1       2   Andrew   21
2       3      Jin   22
3       4     Alan   34
4       5  Anthony   31
5       6    Billy   27
6       7     Alex   27
7       8    Alvin   35

#### 리스트의 딕셔너리에서 row를 하나씩 추가하기

In [48]:
## 컬럼 이름만 있는 빈 깡통 만들기
user_df = pd.DataFrame(columns=["UserID","Name","Age"])

## index를 이용하여 row 값을 하나씩 추가
for idx in range(1,9):
    
    ## 이름이 있을 경우 새로운 이름을 뽑음    
    name = makedata.get_name()
    while name in list(user_df["Name"]):
        name = makedata.get_name()
    
    data = {"Name": name, "UserID": idx, "Age": makedata.get_age()}

    user_df.loc[len(user_df)] = data
    
user_df

  UserID     Name Age
0      1     Alan  20
1      2  Anthony  24
2      3   Arnold  22
3      4    Billy  36
4      5     Alex  32
5      6   Anchal  27
6      7    Alvin  40
7      8   Andrew  21

## quiz 2
- money_df 만들기
    - 15개의 데이터
    - ID : 1 ~ 8 랜덤 숫자
    - money : 1000원 단위로 1000원 ~ 20000원 까지 숫자

#### 딕셔너리 데이터를 데이터 프레임에 하나씩 추가하기

In [42]:
money_df = pd.DataFrame(columns=["ID","Money"])

for idx in range(15):
    money_df.loc[idx] = {
        "ID" : np.random.randint(1,9), 
        "Money" : np.random.randint(1,21) * 1000
    }
    
money_df

   ID  Money
0   8   6000
1   6   5000
2   4  13000
3   7  16000
4   3   4000
5   3   4000
6   5   2000
7   8  16000
8   4   1000
9   4   9000
10  5  15000
11  7  19000
12  7  16000
13  7  14000
14  4   6000

#### 컬럼데이터에서 Unique 값 확인

In [59]:
ids = money_df["ID"].unique()
ids.sort()
ids

array([3, 4, 5, 6, 7, 8], dtype=object)

## quiz 3
user table과 merge 해서 각각 income으로 합 구하기

### - merge

In [108]:
# sql의 join on 과 같음
user_df.merge(
    money_df,left_on="UserID", right_on="ID"
)

Empty DataFrame
Columns: [UserID, Name, Age, ID, Money]
Index: []

### - 컬럼명 변경

In [62]:
user_df.rename(columns={"UserID":"ID"},inplace=True)
user_df.tail(1)

  ID    Name Age
7  8  Andrew  21

In [63]:
## 데이터 프레임 안의 객체를 사용
user_df.merge(money_df)

   ID    Name Age  Money
0   3  Arnold  22   4000
1   3  Arnold  22   4000
2   4   Billy  36  13000
3   4   Billy  36   1000
4   4   Billy  36   9000
5   4   Billy  36   6000
6   5    Alex  32   2000
7   5    Alex  32  15000
8   6  Anchal  27   5000
9   7   Alvin  40  16000
10  7   Alvin  40  19000
11  7   Alvin  40  16000
12  7   Alvin  40  14000
13  8  Andrew  21   6000
14  8  Andrew  21  16000

In [72]:
## pandas 제공 기능
result_df = pd.merge(user_df, money_df)
result_df

   ID    Name Age  Money
0   3  Arnold  22   4000
1   3  Arnold  22   4000
2   4   Billy  36  13000
3   4   Billy  36   1000
4   4   Billy  36   9000
5   4   Billy  36   6000
6   5    Alex  32   2000
7   5    Alex  32  15000
8   6  Anchal  27   5000
9   7   Alvin  40  16000
10  7   Alvin  40  19000
11  7   Alvin  40  16000
12  7   Alvin  40  14000
13  8  Andrew  21   6000
14  8  Andrew  21  16000

### - Groupby
- sum, size, min : return Series
- agg("sum) : return DataFrame

In [73]:
money_list = result_df.groupby("Name").sum()["Money"].reset_index()
money_list

     Name  Money
0    Alex  17000
1   Alvin  65000
2  Anchal   5000
3  Andrew  22000
4  Arnold   8000
5   Billy  29000

In [76]:
money_list = result_df.groupby("Name").agg("sum").reset_index()[["Name","Money"]]
money_list

     Name  Money
0    Alex  17000
1   Alvin  65000
2  Anchal   5000
3  Andrew  22000
4  Arnold   8000
5   Billy  29000

In [2]:
## merge
result = pd.merge(user_df, money_list, how="outer")
result

NameError: name 'user_df' is not defined

### - fillna : NaN 을 특정 데이터로 채워줌
- 데이터 전처리시 없는 데이터를 0, 최소값, 최대값, 평균값 등으로 채움

In [42]:
result.fillna(value=0, inplace=True)
result

   ID     Name  Age    Money
0   1     Alan   34  13000.0
1   2   Andrew   37   8000.0
2   3  Anthony   20  41000.0
3   4     Adam   20  33000.0
4   5     Alex   38  50000.0
5   6    Billy   30      0.0
6   7    Alvin   38  44000.0
7   8   Anchal   27      0.0

### - 컬럼을 정수로 데이터 타입 변경

In [43]:
result.dtypes

ID         int64
Name      object
Age        int64
Money    float64
dtype: object

In [45]:
result["Money"] = result["Money"].astype("int")
result

   ID     Name  Age  Money
0   1     Alan   34  13000
1   2   Andrew   37   8000
2   3  Anthony   20  41000
3   4     Adam   20  33000
4   5     Alex   38  50000
5   6    Billy   30      0
6   7    Alvin   38  44000
7   8   Anchal   27      0

In [48]:
result.sort_values("Money",ascending=False)[:3]

   ID     Name  Age  Money
4   5     Alex   38  50000
6   7    Alvin   38  44000
2   3  Anthony   20  41000

In [49]:
np.average(result.sort_values("Money",ascending=False)[:3]["Money"])

45000.0

In [50]:
np.average(result.sort_values("Money",ascending=False)[:3]["Age"])

32.0

## quiz 4

In [1]:
quiz = pd.read_csv("quiz.csv")

FileNotFoundError: [Errno 2] File quiz.csv does not exist: 'quiz.csv'

In [65]:
gnp_chn = [
    {"year" : 2016 , "china" : 8210},
    {"year" : 2017 , "china" : 8630},
    {"year" : 2018 , "china" : 9470},    
]
gnp_chn = pd.DataFrame(gnp_chn)
gnp_chn

   year  china
0  2016   8210
1  2017   8630
2  2018   9470

In [66]:
gnp_usa = [
    {"year" : 2016 , "USA" : 82310},
    {"year" : 2017 , "USA" : 86350},
    {"year" : 2018 , "USA" : 94770},    
]
gnp_usa = pd.DataFrame(gnp_usa)
gnp_usa

   year    USA
0  2016  82310
1  2017  86350
2  2018  94770

In [67]:
gnp = gnp_usa.merge(gnp_chn)
gnp

   year    USA  china
0  2016  82310   8210
1  2017  86350   8630
2  2018  94770   9470

In [77]:
gnp["Total"] = gnp["USA"] + gnp["china"]
gnp

   year    USA  china   Total
0  2016  82310   8210   90520
1  2017  86350   8630   94980
2  2018  94770   9470  104240

## quiz 5

In [50]:
score_dict = {
    'Name': ["na","he","na","he","na","he","na","he","na","he"],
    'Score' : [50,40,60,60,50,40,70,60,80,70]
}

df_quiz = pd.DataFrame(score_dict)
df_quiz

  Name  Score
0   na     50
1   he     40
2   na     60
3   he     60
4   na     50
5   he     40
6   na     70
7   he     60
8   na     80
9   he     70

In [53]:
test1 = df_quiz.groupby("Name").sum()["Score"]
test1

Name
he    270
na    310
Name: Score, dtype: int64

In [58]:
test2 = df_quiz.groupby("Name").mean().reset_index()
test2

  Name  Score
0   he     54
1   na     62